TexasInstruments/mcupsdk-core-k3/examples/drivers/ospi/ospi_flash_io/am62lx-sk/a53ss0-0_freertos/example.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "AM62Lx" --part "AM62L32-G-ANB" --package "ANB" --context "a53ss0-0" --product "MCU_PLUS_SDK@07.03.01"
 * @v2CliArgs --device "AM62L32" --package "FCBGA (ANB)" --variant "AM62L32-G" --context "a53ss0-0" --product "MCU_PLUS_SDK@07.03.01"
 * @versions {"tool":"1.21.999+170"}
 */

/**
 * Import the modules used in this configuration.
 */
const flash      = scripting.addModule("/board/flash/flash", {}, false);
const flash1     = flash.addInstance();
const clock      = scripting.addModule("/kernel/dpl/clock");
const debug_log  = scripting.addModule("/kernel/dpl/debug_log");
const mmu_armv8  = scripting.addModule("/kernel/dpl/mmu_armv8", {}, false);
const mmu_armv81 = mmu_armv8.addInstance();
const mmu_armv82 = mmu_armv8.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
flash1.$name                                                   = "CONFIG_FLASH0";
flash1.serialFlashDriver.$name                                 = "board_flash_serialFlash_serialflash0";
flash1.serialFlashDriver.peripheralDriver.$name                = "CONFIG_OSPI0";
flash1.serialFlashDriver.peripheralDriver.txDllLowWindowStart  = 28;
flash1.serialFlashDriver.peripheralDriver.txDllLowWindowEnd    = 48;
flash1.serialFlashDriver.peripheralDriver.txDllHighWindowStart = 60;
flash1.serialFlashDriver.peripheralDriver.txDllHighWindowEnd   = 96;
flash1.serialFlashDriver.peripheralDriver.rxLowSearchEnd       = 40;
flash1.serialFlashDriver.peripheralDriver.rxHighSearchStart    = 24;
flash1.serialFlashDriver.peripheralDriver.rxHighSearchEnd      = 107;
flash1.serialFlashDriver.peripheralDriver.txLowSearchStart     = 16;
flash1.serialFlashDriver.peripheralDriver.txLowSearchEnd       = 64;
flash1.serialFlashDriver.peripheralDriver.txHighSearchStart    = 78;
flash1.serialFlashDriver.peripheralDriver.txHighSearchEnd      = 127;
flash1.serialFlashDriver.peripheralDriver.txDLLSearchOffset    = 8;
flash1.serialFlashDriver.peripheralDriver.rdDelayMin           = 1;
flash1.serialFlashDriver.peripheralDriver.rdDelayMax           = 4;

debug_log.enableUartLog = true;
debug_log.uartLog.$name = "CONFIG_UART0";

mmu_armv81.$name = "SOC_MEM_REGION";
mmu_armv81.size  = 0x80000000;

mmu_armv82.$name     = "DDR_REGION";
mmu_armv82.vAddr     = 0x80000000;
mmu_armv82.pAddr     = 0x80000000;
mmu_armv82.size      = 0x80000000;
mmu_armv82.attribute = "MAIR7";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
flash1.serialFlashDriver.peripheralDriver.OSPI.$suggestSolution      = "OSPI0";
flash1.serialFlashDriver.peripheralDriver.OSPI.CLK.$suggestSolution  = "OSPI0_CLK";
flash1.serialFlashDriver.peripheralDriver.OSPI.CSn0.$suggestSolution = "OSPI0_CSn0";
flash1.serialFlashDriver.peripheralDriver.OSPI.DQS.$suggestSolution  = "OSPI0_DQS";
flash1.serialFlashDriver.peripheralDriver.OSPI.D7.$suggestSolution   = "OSPI0_D7";
flash1.serialFlashDriver.peripheralDriver.OSPI.D6.$suggestSolution   = "OSPI0_D6";
flash1.serialFlashDriver.peripheralDriver.OSPI.D5.$suggestSolution   = "OSPI0_D5";
flash1.serialFlashDriver.peripheralDriver.OSPI.D4.$suggestSolution   = "OSPI0_D4";
flash1.serialFlashDriver.peripheralDriver.OSPI.D3.$suggestSolution   = "OSPI0_D3";
flash1.serialFlashDriver.peripheralDriver.OSPI.D2.$suggestSolution   = "OSPI0_D2";
flash1.serialFlashDriver.peripheralDriver.OSPI.D1.$suggestSolution   = "OSPI0_D1";
flash1.serialFlashDriver.peripheralDriver.OSPI.D0.$suggestSolution   = "OSPI0_D0";
debug_log.uartLog.UART.$suggestSolution                              = "USART0";
debug_log.uartLog.UART.RXD.$suggestSolution                          = "UART0_RXD";
debug_log.uartLog.UART.TXD.$suggestSolution                          = "UART0_TXD";
